{
  "profile": {
    "birthdayDate": "1994-08-25",
    "currentLanguage": "English",
    "currentLanguageIcon": "flag-en",
    "follow": "Follow Me",
    "contact": "Contact Me",
    "description": {
      "title": "I work with "
    }
  },
  "biography": {
    "title": "Biography",
    "text": "<p> With a passion for technology since childhood, I am currently working at Be Shaping as a consultant for UniCredit, developing services in the security field. I use technologies such as <code>Java</code>, <code>Spring Boot</code>, <code>Angular</code>, <code>Docker</code>, <code>Jenkins</code>, <code>Google Cloud</code>, <code>PostgreSQL</code>, <code>MySQL</code>, <code>Strapi</code>, <code>HTML</code>, <code>CSS</code>, and <code>JavaScript</code>. </p> <p> I have taken several courses to improve my skills, including the Java course, which has allowed me to deepen my knowledge of this technology. </p> <p> My skills include solving complex problems, effective collaboration with teams, project management and planning, adaptability to new technologies and work environments, and experience in leading development teams. </p> <p> My goal is to work on innovative projects that enhance the efficiency and security of software solutions, attract new clients, and collaborate with major companies to create cutting-edge solutions. I aim to expand my knowledge, take on new challenges, and contribute to the development of technologies that make a difference. </p> <p> I am always looking for opportunities to grow professionally and collaborate with teams that share my passion for innovation. If you would like to discuss projects or collaboration opportunities, you can contact me through my social media or the 'Contact Me' section of my website. </p>"
  },
  "works-section": {
    "title": "Work Experience"
  },
  "works": [
    {
      "identifier": 1,
      "title": "Be | Shaping the Future",
      "from": "From June 2021",
      "to": "Current",
      "role": "Specialist",
      "where": "Milan, Italy",
      "description": "<p> After starting my career with the UniCredit group, I later worked at Hype, contributing to projects involving technologies like <code>Azure Pipeline</code> and its ecosystem. During this experience, I worked on applications based on <code>Spring Boot</code>, further strengthening my skills in this framework. <br><br> Currently, I work in the security domain at UniCredit, where I am involved in developing login solutions for corporate users in different countries, such as Germany and the Czech Republic. Additionally, I collaborate on projects related to <code>SCIM</code> (System for Cross-domain Identity Management), using technologies like <code>Spring Boot</code> and <code>PostgreSQL</code> to ensure secure and efficient access on an international scale. <br><br> Recently, I have taken on the role of Team Leader, where I manage and introduce team members to various projects and tasks, guiding their professional development and ensuring the success of the projects. <br><br> I use the latest technologies such as <code>Spring Boot Reactor</code>, <code>Apache Kafka</code> for event streaming, <code>Redis</code> for caching solutions, <code>Angular</code> for front-end development, <code>Java 22</code> for advanced programming, and <code>Docker</code> containers for application isolation and deployment. I also utilize <code>Google Cloud</code> for deployments and comprehensive logging solutions to ensure robust and secure application performance. <br><br> Throughout my career, I have gained solid experience in managing code coverage, conducting accurate tests with <code>JUnit</code> and <code>Mockito</code>. I have also honed my skills in performing local and large-scale tests using <code>Postman</code> and related environments. <br><br> My experience spans various Pre-Deploy and Deploy environments, utilizing tools such as <code>Jenkins</code>, <code>Docker</code>, and <code>OpenShift Pods</code>. I have worked with various databases, including <code>MySQL</code>, <code>PostgreSQL</code>, and <code>Oracle SQL</code>, contributing to the robustness of application operations. </p>"
    },
    {
      "identifier": 2,
      "title": "Freelance Web Developer",
      "from": "From January 2021",
      "to": "Current",
      "role": "Graphic Web Design",
      "where": "Bristol, United Kingdom",
      "description": "<p> Throughout my journey as a Web Designer, I have worked on various personal projects, designing and maintaining websites using <code>HTML, CSS, and JavaScript</code>. I dedicated myself to creating engaging and visually appealing content, aiming to effectively communicate the identity and message of the projects I was working on. I meticulously designed web pages, ensuring a smooth user experience and easy navigation. <br> Additionally, I integrated social media links to enhance connectivity and user engagement. I conducted thorough testing of websites across different browsers and devices to ensure compatibility and optimal performance. This rigorous process allowed me to quickly identify and resolve any issues, ensuring a consistent experience for all users. <br> Over the past few years, I have also worked with advanced technologies such as <code>Angular</code> for front-end development, <code>Spring Boot</code> as microservices for the back-end, and <code>Hibernate</code> for data persistence management. These experiences have enabled me to build modern, scalable, and high-performance web applications, integrating best practices for both user interfaces and business logic. <br> I have always kept myself updated with the latest web design trends and technologies, incorporating modern and innovative elements into my projects. By focusing on both aesthetics and functionality, I have created websites that are not only visually impressive but also highly functional and user-friendly. </p>"
    },
    {
      "identifier": 3,
      "title": "Freelance IT Technician",
      "from": "From May 2012",
      "to": "To January 2020",
      "role": "IT Technician",
      "where": "Bristol, United Kingdom",
      "description": "<p> During my professional experience, I have tackled a variety of technical tasks that have allowed me to develop advanced skills in the maintenance and repair of computer systems and mobile devices. I diagnosed and resolved technical issues efficiently, always ensuring data integrity throughout the process. My work included the regular maintenance and updating of <code>Windows</code> and <code>Mac</code> operating systems, ensuring they remained secure and performant. <br> Additionally, I upgraded old laptops by installing lightweight operating systems such as <code>Linux</code>, <code>Chrome OS</code>, and <code>Debian</code>, significantly improving their efficiency and usability. Part of my role also involved hardware upgrades, where I installed new components like RAM and SSDs to enhance system performance. <br> I tackled and resolved various operating system issues, ensuring that all software ran correctly and stably. I managed the installation and maintenance of essential software such as <code>Adobe</code>, <code>Office</code>, <code>VMWare</code>, and <code>Eclipse</code>, keeping programs updated to meet user needs. <br> Another aspect of my job was data recovery, where I assisted both individuals and small to medium-sized businesses in retrieving crucial information, minimizing data loss. I also repaired and maintained <code>Android</code> and <code>iOS</code> smartphones, resolving technical issues and extending the lifespan of the devices. </p>"
    },
    {
      "identifier": 4,
      "title": "Rock N Bowl",
      "from": "From September 2018",
      "to": "To September 2019",
      "role": "Hostel Duty Manager",
      "where": "Bristol, United Kingdom",
      "description": "<p> Throughout my career, I have had the opportunity to take on various roles that have significantly contributed to my growth and experience, including: <br> &bull; Reservation management and customer relations. <br> &bull; Staff supervision and organization of daily activities. <br> &bull; Responsibility in hiring and training personnel. <br> &bull; Office operations coordination and daily/weekly closure. <br> &bull; Pricing management for accommodations and optimization strategies. <br> &bull; Organization of events for large groups. <br> &bull; Collaboration with platforms such as Expedia, Booking.com, Agoda. <br> &bull; Social media management and development of communication strategies. </p>"
    }
  ],
  "footer": {
    "title": "Giovanni Lamarmora | This portfolio is powered by AngularJS and Bootstrap for the front end, with a backend powered by Spring Boot Reactor. Content management is efficiently handled by Strapi CMS.",
    "subtitle": "Copyright &copy; #YEAR# Giovanni Lamarmora. All rights reserved.",
    "link": "Useful Link",
    "follow": "Follow Me",
    "home": "Homepage",
    "biography": "Biography",
    "works": "Works",
    "courses": "Courses",
    "projects": "Projects",
    "contact": "Contact Me"
  },
  "languages": {
    "title": "Languages",
    "data": [
      {
        "name": "Italian",
        "image": "assets/img/languages/Italy.webp",
        "flags": "flag-it",
        "description": "Native Languages",
        "speaking_title": "Speaking",
        "speaking_rate": "100",
        "speaking_width": "width: 100%",
        "writing_title": "Writing",
        "writing_rate": "100",
        "writing_width": "width: 100%",
        "comprehension_title": "Comprehension",
        "comprehension_rate": "100",
        "comprehension_width": "width: 100%"
      },
      {
        "name": "English",
        "image": "assets/img/languages/English.webp",
        "flags": "flag-en",
        "description": "C1 (Advanced)",
        "speaking_title": "Speaking",
        "speaking_rate": "83",
        "speaking_width": "width: 83%",
        "writing_title": "Writing",
        "writing_rate": "83",
        "writing_width": "width: 83%",
        "comprehension_title": "Comprehension",
        "comprehension_rate": "83",
        "comprehension_width": "width: 83%"
      },
      {
        "name": "Spanish",
        "image": "assets/img/languages/spagna.webp",
        "flags": "flag-es",
        "description": "B1 (Intermediate)",
        "speaking_title": "Speaking",
        "speaking_rate": "67",
        "speaking_width": "width: 67%",
        "writing_title": "Writing",
        "writing_rate": "50",
        "writing_width": "width: 50%",
        "comprehension_title": "Comprehension",
        "comprehension_rate": "67",
        "comprehension_width": "width: 67%"
      }
    ]
  },
  "course-section": {
    "title": "Professional Training",
    "courses": [
      {
        "identifier": 1,
        "title": "Generation Italy",
        "from": "From February 2021",
        "to": "To May 2021",
        "role": "Java Developer Course",
        "where": "Milan, Italy",
        "description": "The 12-week online course, with daily frequency from 9AM to 6PM, organized by Generation Italy (Mc Kinsey) in collaboration with <code>Intesa Sanpaolo</code>, allowed me to acquire the basics for the development of software applications and management of web services.<br>In particular, we have explored the main types of server applications <code>(Jee, Mvc and Ajax)</code> and the <code>Spring</code> and <code>Hibernate</code> frameworks, with some FrontEnd such as <code>HTML5, CSS and JavaScript</code>.<br>The final weeks were dedicated to <code>Soap and Restful web services</code> and to the realization of a project. <br>At the same time we have worked for the development of behavioral skills such as: <code>teamwork, adaptability, communication, persistence, personal responsibility, growth mentality and future orientation.</code>"
      },
      {
        "identifier": 2,
        "title": "Cisco Networking Academy",
        "from": "From September 2018",
        "to": "To November 2019",
        "role": "CCNA 1, 2, 3, 4 Routing And Switching",
        "where": "City of Bristol College, Bristol, United Kingdom",
        "description": "<strong><h4>CCNA 1: Introduction to Networks, Score: 89.5/100</h4></strong> <p> I successfully completed the <code>CCNA Routing and Switching: Introduction to Networks</code> course, where I acquired fundamental skills in Cisco network introduction, understanding network technologies, and initial network device configuration. During the course, I deepened my knowledge of router hardware and learned to configure basic network parameters. </p> <hr> <strong><h4>CCNA 2: Routing and Switching Essentials, Score: 89.1/100</h4></strong> <p> I successfully completed the <code>CCNA Routing and Switching: Routing and Switching Essentials</code> course, which allowed me to refine skills in advanced network device configuration, implementation of <code>VLANs</code>, management of <code>DHCP</code>, and <code>NAT</code> configuration. This course provided me with a solid practical foundation for managing complex networks and improving connectivity performance. </p> <hr> <strong><h4>CCNA 3: Scaling Networks</h4></strong> <p> I successfully completed the <code>CCNA Routing and Switching: Scaling Networks</code> course, where I delved into configuration and troubleshooting of <code>STP</code> (Spanning Tree Protocol) and <code>VTP</code> (VLAN Trunking Protocol). I gained advanced skills in managing <code>VLANs</code>, <code>inter-VLAN</code> configuration, and <code>IPv4</code> and <code>IPv6</code> protocol management. This course prepared me to successfully tackle larger networks and implement scalable solutions. </p> <hr> <strong><h4>CCNA 4: Advanced Networks</h4></strong> <p> I successfully completed the <code>CCNA Routing and Switching: Advanced Networks</code> course, which provided me with in-depth knowledge of <code>WAN</code> networks and how to configure and troubleshoot <code>PPP</code> (Point-to-Point Protocol). During the course, I learned to implement <code>PPPoE</code>, <code>GRE</code>, and single-homed <code>eBGP</code>, as well as develop skills in <code>LAN</code> security and network troubleshooting for small to medium enterprises. </p>"
      },
      {
        "identifier": 3,
        "title": "English Language: Level B1",
        "from": "From January 2017",
        "to": "To May 2017",
        "role": "English Course Level B1",
        "where": "City of Bristol College, Bristol, United Kingdom",
        "description": "<p> I successfully completed the English Language Course at B1 level, achieving proficiency in both written and spoken English. Throughout the course, I honed my ability to engage in everyday conversations, express opinions, and comprehend complex texts. I developed essential language skills such as grammar, vocabulary expansion, and effective communication strategies. <br><br> The course enhanced my listening skills, enabling me to understand English spoken at a normal speed with various accents and dialects. I also improved my reading comprehension, effectively extracting key information from articles, reports, and literary texts. <br><br> Additionally, I practiced writing coherent and structured texts, including formal emails, reports, and essays. This course provided a solid foundation in English language proficiency, empowering me to communicate fluently and confidently in professional and social settings. </p>"
      },
      {
        "identifier": 4,
        "title": "CEH Cyber Security",
        "from": "From November 2017",
        "to": "To February 2018",
        "role": "Cyber Security: Introducing to the World of Cyber Security",
        "where": "Smart Learning, Udemy",
        "description": "<p> Throughout the Cyber Security CEH course, I delved into the role of an Ethical Hacker and their responsibilities in safeguarding computer networks. I acquired advanced skills in diagnosing and resolving vulnerabilities while maintaining data integrity throughout the process. <br><br> I learned to configure and utilize virtual machines for secure testing environments, installing and managing operating systems such as <code>Windows</code> and <code>Kali Linux</code>. I developed proficiency in advanced command-line operations in <code>Linux</code> environments and adeptly managed key network protocols like <code>DNS</code>, <code>PING</code>, <code>ARP</code>, and <code>TRACEROUTE</code>. <br><br> During the course, I explored ethical hacking techniques like <code>Google Hacking</code> for gathering sensitive information online and identifying vulnerabilities using tools such as <code>Shodan</code> and <code>Nmap</code>. I mastered the setup and utilization of honeypots to attract and analyze attacks, along with advanced skills in network traffic analysis using tools like <code>Wireshark</code>. <br><br> Additionally, I studied the differences between <code>TCP</code> and <code>UDP</code> communication protocols, active and passive fingerprinting techniques for system and application identification, and conducted vulnerability assessments using tools such as <code>Nessus</code> and <code>Nexpose</code>. <br><br> I also deepened my understanding of frameworks like <code>Metasploit</code> for developing and executing exploits, and gained proficiency in the <code>METERPRETER</code> shell for remote control of compromised systems. I explored privilege escalation techniques and malicious code injection for testing application security. <br><br> Lastly, I compiled detailed reports on Penetration Testing results, thoroughly documenting discovered vulnerabilities and providing security recommendations to enhance network and system protection. </p>"
      }
    ]
  },
  "contact": {
    "title": "Get in Touch",
    "profile_title": "Profile",
    "name": "Giovanni Lamarmora",
    "name_title": "Name",
    "age_title": "Age",
    "from": "Milan, Italy",
    "from_title": "From",
    "downloadCV": "Download CV",
    "follow_me": "Follow me",
    "contact_me": "Send me a Message",
    "email_title": "Email",
    "description": "Tell me more about your request...",
    "send": "Send Message",
    "experience_title": "Years Experiance",
    "work_project": "15",
    "work_project_title": "Projects Done <br>Be | Shaping The Future",
    "project": "13",
    "project_title": "Personal Projects",
    "course": "8",
    "course_title": "Courses Done",
    "send_email": {
      "title": "Hi $NAME$ , do you want to send the message?",
      "not_send": "Don't send",
      "send": "Send",
      "send_error": "Error sending the message!",
      "send_success": "Message sent successfully!",
      "not_send_error": "Not Sended!"
    }
  },
  "project-section": {
    "title": "Personal Projects",
    "btn_project": "Explore All",
    "go_back": "Go back to Homepage",
    "projects": [
      {
        "id": 1,
        "image": "assets/img/project/send-email.webp",
        "title": "Email-Sender",
        "subtitle": "Service",
        "description": "Implemented using Spring Boot, Email Sender utilizes Google's SMTP service for efficient email communication. Integrated into your website and other personal applications, it facilitates direct messaging and notifications.",
        "button_text": "Open App",
        "button_link": "https://email-sender.giovannilamarmora.com"
      },
      {
        "id": 2,
        "image": "assets/img/project/logo_no_name.png",
        "button_link": "https://moneystats.github.io",
        "title": "MoneyStats",
        "subtitle": "Application",
        "button_text": "Apri App",
        "description": "Developed in Spring Boot and Angular, MoneyStats is an application for personal finance management. It leverages MySQL for backend operations, allowing users to monitor and analyze their income and expenditures effectively."
      },
      {
        "id": 3,
        "image": "assets/img/project/GitHub-Alternatives.webp",
        "title": "More Project on Github",
        "subtitle": "Giovanni Lamarmora",
        "button_text": "Explore All",
        "button_link": "https://github.com/giovannilamarmora",
        "description": "Explore a different array of projects on my GitHub profile, showcasing expertise across various technological domains. From personal projects to contributions to open-source repositories, each project underscores my skills and dedication to software development."
      }
    ]
  },
  "info": {
    "title": "This WebSite is under developing",
    "text": "The version showed it's not the official version, new content are coming soon, Stay Tuned."
  },
  "email_content": {
    "title": "WELCOME $NAME$!",
    "sub-title": "Thanks to contact me, that's the copy of your email.",
    "important": "I'll contact you back a soon as i can, in the maintime if you have any questions, just reply to this email.",
    "thanks": "Cheers, Giovanni Lamarmora"
  }
}
