{
  "profile": {
    "birthdayDate": "1994-08-25",
    "currentLanguage": "Italian",
    "currentLanguageIcon": "flag-it",
    "follow": "Seguimi",
    "contact": "Contattami",
    "description": {
      "title": "Lavoro con "
    }
  },
  "biography": {
    "title": "Biografia",
    "text": "<p> Con una passione per la tecnologia sin dall'infanzia, lavoro attualmente in Be Shaping come consulente per UniCredit, sviluppando servizi in ambito sicurezza. Utilizzo tecnologie come <code>Java</code>, <code>Spring Boot</code>, <code>Angular</code>, <code>Docker</code>, <code>Jenkins</code>, <code>Google Cloud</code>, <code>PostgreSQL</code>, <code>MySQL</code>, <code>Strapi</code>, <code>HTML</code>, <code>CSS</code> e <code>JavaScript</code>. </p> <p> Ho seguito diversi corsi per migliorare le mie competenze, tra cui il corso Java, che mi ha permesso di approfondire la mia conoscenza di questa tecnologia. </p> <p> Le mie abilità comprendono la risoluzione di problemi complessi, la collaborazione efficace con team, la gestione e pianificazione di progetti, l'adattabilità a nuove tecnologie e ambienti di lavoro, e l'esperienza nel guidare team di sviluppo. </p> <p> Il mio obiettivo è lavorare su progetti innovativi che aumentino l'efficienza e la sicurezza delle soluzioni software, attrarre nuovi clienti e collaborare con grandi aziende per creare soluzioni all'avanguardia. Voglio espandere le mie conoscenze, mettermi alla prova con nuove sfide e contribuire allo sviluppo di tecnologie che fanno la differenza. </p> <p> Sono sempre alla ricerca di opportunità per crescere professionalmente e collaborare con team che condividono la mia passione per l'innovazione. Se desideri discutere di progetti o opportunità di collaborazione, puoi contattarmi tramite i miei social media o nella sezione 'Contattami' del mio sito web. </p>"
  },
  "works-section": {
    "title": "Esperienza Lavorativa"
  },
  "works": [
    {
      "identifier": 1,
      "title": "Be | Shaping the Future",
      "from": "Da Giugno 2021",
      "to": "Attuale",
      "role": "Specialist",
      "where": "Milan, Italy",
      "description": "<p> Dopo aver iniziato la mia carriera con il gruppo UniCredit, ho successivamente lavorato presso Hype, contribuendo a progetti che coinvolgevano tecnologie come <code>Azure Pipeline</code> e il suo ecosistema. Durante questa esperienza, ho lavorato su applicazioni basate su <code>Spring Boot</code>, continuando a rafforzare le mie competenze in questo framework. <br><br> Attualmente, lavoro nell'ambito della sicurezza presso UniCredit, dove sono coinvolto nello sviluppo di soluzioni di login per utenti corporate in diverse country, come Germania e Repubblica Ceca. Inoltre, collaboro su progetti legati al <code>SCIM</code> (System for Cross-domain Identity Management), utilizzando tecnologie come <code>Spring Boot</code> e <code>PostgreSQL</code> per garantire un accesso sicuro ed efficiente a livello internazionale. <br><br> Recentemente, ho assunto il ruolo di Team Leader, dove gestisco e introduco i membri del team ai diversi progetti e task, guidando il loro sviluppo professionale e garantendo il successo dei progetti. <br><br> Utilizzo le ultime tecnologie come <code>Spring Boot Reactor</code>, <code>Apache Kafka</code> per lo streaming di eventi, <code>Redis</code> per soluzioni di caching, <code>Angular</code> per lo sviluppo front-end, <code>Java 22</code> per la programmazione avanzata, e container <code>Docker</code> per l'isolamento e la distribuzione delle applicazioni. Utilizzo anche <code>Google Cloud</code> per i deploy e soluzioni di log complete per garantire prestazioni applicative robuste e sicure. <br><br> Durante la mia carriera, ho acquisito una solida esperienza nella gestione della copertura del codice, conducendo test accurati con <code>JUnit</code> e <code>Mockito</code>. Ho anche affinato le mie competenze nell'esecuzione di test locali e su larga scala utilizzando <code>Postman</code> e ambienti correlati. <br><br> La mia esperienza copre vari ambienti di Pre-Deploy e Deploy, utilizzando strumenti come <code>Jenkins</code>, <code>Docker</code> e <code>OpenShift Pods</code>. Ho lavorato con vari database, tra cui <code>MySQL</code>, <code>PostgreSQL</code> e <code>Oracle SQL</code>, contribuendo alla robustezza delle operazioni applicative. </p>"
    },
    {
      "identifier": 2,
      "title": "Freelance Web Developer",
      "from": "Da Gennaio 2021",
      "to": "Attuale",
      "role": "Graphic Web Design",
      "where": "Bristol, United Kingdom",
      "description": "<p> Nel mio percorso come Web Designer, ho lavorato a diversi progetti personali, occupandomi della progettazione e della manutenzione di siti web utilizzando <code>HTML, CSS e JavaScript</code>. Mi sono dedicato alla creazione di contenuti coinvolgenti e visivamente accattivanti, con l'obiettivo di comunicare efficacemente l'identità e il messaggio dei progetti su cui stavo lavorando. Ho progettato con cura le pagine web, garantendo un'esperienza utente fluida e una navigazione semplice. <br> Inoltre, ho integrato collegamenti ai social media per migliorare la connettività e il coinvolgimento degli utenti. Ho eseguito test approfonditi dei siti web su vari browser e dispositivi per assicurare compatibilità e prestazioni ottimali. Questo processo rigoroso mi ha permesso di identificare e risolvere rapidamente eventuali problemi, garantendo un'esperienza coerente per tutti gli utenti. <br> Negli ultimi anni, ho anche lavorato con tecnologie avanzate come <code>Angular</code> per lo sviluppo front-end, <code>Spring Boot</code> come microservizi per il back-end e <code>Hibernate</code> per la gestione della persistenza dei dati. Queste esperienze mi hanno permesso di costruire applicazioni web moderne, scalabili e ad alte prestazioni, integrando le migliori pratiche sia per l'interfaccia utente che per la logica di business. <br> Mi sono sempre tenuto aggiornato sulle ultime tendenze e tecnologie del web design, incorporando elementi moderni e innovativi nei miei progetti. Con un'attenzione particolare all'estetica e alla funzionalità, ho creato siti web che non solo risultano visivamente impressionanti, ma anche altamente funzionali e facili da usare. </p>"
    },
    {
      "identifier": 3,
      "title": "Freelance IT Technician",
      "from": "Da Maggio 2012",
      "to": "A Gennaio 2020",
      "role": "IT Technician",
      "where": "Bristol, United Kingdom",
      "description": "<p> Durante la mia esperienza professionale, ho affrontato una varietà di compiti tecnici che mi hanno permesso di sviluppare competenze avanzate nella manutenzione e riparazione di sistemi informatici e dispositivi mobili. Ho diagnosticato e risolto problemi tecnici in modo efficiente, garantendo sempre l'integrità dei dati durante il processo. Il mio lavoro comprendeva la manutenzione e l'aggiornamento regolare dei sistemi operativi <code>Windows</code> e <code>Mac</code>, assicurando che fossero sempre sicuri e performanti. <br> Inoltre, ho aggiornato vecchi laptop installando sistemi operativi leggeri come <code>Linux</code>, <code>Chrome OS</code> e <code>Debian</code>, migliorando significativamente la loro efficienza e usabilità. Parte del mio ruolo includeva anche l'upgrade hardware, dove ho installato nuovi componenti come RAM e SSD per potenziare le prestazioni dei sistemi. <br> Ho affrontato e risolto vari problemi del sistema operativo, assicurandomi che ogni software funzionasse correttamente e stabilmente. Ho gestito l'installazione e la manutenzione di software essenziali come <code>Adobe</code>, <code>Office</code>, <code>VMWare</code> e <code>Eclipse</code>, mantenendo sempre aggiornati i programmi per soddisfare le esigenze degli utenti. <br> Un altro aspetto del mio lavoro è stato il recupero dati, dove ho assistito sia privati che piccole e medie aziende a recuperare informazioni cruciali, minimizzando la perdita di dati. Ho inoltre riparato e mantenuto smartphone <code>Android</code> e <code>iOS</code>, risolvendo problemi tecnici e prolungando la durata dei dispositivi. </p>"
    },
    {
      "identifier": 4,
      "title": "Rock N Bowl",
      "from": "Da Settembre 2018",
      "to": "A Settembre 2019",
      "role": "Hostel Duty Manager",
      "where": "Bristol, United Kingdom",
      "description": "<p> Durante il mio percorso professionale, ho avuto l'opportunità di assumere diversi ruoli che hanno contribuito significativamente alla mia crescita e alla mia esperienza, tra cui: <br> &bull; Gestione delle prenotazioni e relazioni con i clienti. <br> &bull; Supervisione del personale e organizzazione delle attività quotidiane. <br> &bull; Responsabilità nell'assunzione e formazione del personale. <br> &bull; Coordinamento delle operazioni d'ufficio e chiusura giornaliera/settimanale. <br> &bull; Gestione dei prezzi dei pernottamenti e strategie di ottimizzazione. <br> &bull; Organizzazione di eventi per grandi gruppi. <br> &bull; Collaborazione con piattaforme come Expedia, Booking.com, Agoda. <br> &bull; Gestione dei Social Media e sviluppo di strategie di comunicazione. </p>"
    }
  ],
  "footer": {
    "title": "Giovanni Lamarmora | Questo portfolio è alimentato da AngularJS e Bootstrap per il front end, con un backend alimentato da Spring Boot Reactor. La gestione dei contenuti è gestita in modo efficiente da Strapi CMS.",
    "subtitle": "Copyright &copy; #YEAR# Giovanni Lamarmora. All rights reserved.",
    "link": "Link Utili",
    "follow": "Seguimi",
    "home": "Home",
    "biography": "Biografia",
    "works": "Lavori",
    "courses": "Corsi",
    "projects": "Progetti",
    "contact": "Contattami",
    "cookie": "Cookie Policy"
  },
  "languages": {
    "title": "Lingue",
    "data": [
      {
        "name": "Italiano",
        "flags": "flag-it",
        "description": "Madrelingua",
        "speaking_title": "Parlato",
        "speaking_rate": "100",
        "speaking_width": "width: 100%",
        "writing_title": "Scritto",
        "writing_rate": "100",
        "writing_width": "width: 100%",
        "comprehension_title": "Comprensione",
        "comprehension_rate": "100",
        "comprehension_width": "width: 100%"
      },
      {
        "name": "Inglese",
        "flags": "flag-en",
        "description": "C1 (Avanzato)",
        "speaking_title": "Parlato",
        "speaking_rate": "83",
        "speaking_width": "width: 83%",
        "writing_title": "Scritto",
        "writing_rate": "83",
        "writing_width": "width: 83%",
        "comprehension_title": "Comprensione",
        "comprehension_rate": "83",
        "comprehension_width": "width: 83%"
      },
      {
        "name": "Spagnolo",
        "flags": "flag-es",
        "description": "B1 (Intermedio)",
        "speaking_title": "Parlato",
        "speaking_rate": "67",
        "speaking_width": "width: 67%",
        "writing_title": "Scritto",
        "writing_rate": "50",
        "writing_width": "width: 50%",
        "comprehension_title": "Comprensione",
        "comprehension_rate": "67",
        "comprehension_width": "width: 67%"
      }
    ]
  },
  "course-section": {
    "title": "Corsi Professionali",
    "courses": [
      {
        "identifier": 1,
        "title": "Generation Italy",
        "from": "Da Febbraio 2021",
        "to": "A Maggio 2021",
        "role": "Corso per Sviluppatore Java",
        "where": "Milan, Italy",
        "description": "Il corso online di 12 settimane, con frequenza giornaliera dalle ore 9 alle 18, organizzato da Generation Italy (Mc Kinsey) in collaborazione con <code>Intesa Sanpaolo</code>, mi ha permesso di acquisire le basi per lo sviluppo di applicazioni software e di gestione dei servizi web.<br>In particolare, abbiamo approfondito le principali tipologie di applicazioni server <code>(Jee, Mvc and Ajax)</code> e i Framework <code>Spring</code> e <code>Hibernate</code>, assieme al FrontEnd come <code>HTML5, CSS and JavaScript</code>.<br> Le settimane finali sono state dedicate ai servizi <code>Soap e Restful web services</code> e alla realizzazione di un progetto. <br> Nel contempo abbiamo lavorato perlo sviluppo di abilità comportamentali quali: <code>lavoro di squadra, adattabilità, comunicazione, persistenza, responsabilità personale, mentalità di crescita e orientamento al futuro.</code>"
      },
      {
        "identifier": 2,
        "title": "Cisco Networking Academy",
        "from": "Da Settembre 2018",
        "to": "A Novembre 2019",
        "role": "CCNA 1, 2, 3, 4 Routing And Switching",
        "where": "City of Bristol College, Bristol, United Kingdom",
        "description": "<strong><h4>CCNA 1: Introduction to Networks, Punteggio: 89.5/100</h4></strong> <p> Ho completato con successo il corso <code>CCNA Routing and Switching: Introduction to Networks</code>, dove ho acquisito competenze fondamentali nell'introduzione alle reti Cisco, comprensione delle tecnologie di rete e configurazione iniziale dei dispositivi. Durante il corso, ho approfondito la conoscenza dell'hardware dei router e ho imparato a configurare i parametri di base della rete. </p> <hr> <strong><h4>CCNA 2: Routing and Switching Essentials, Punteggio: 89.1/100</h4></strong> <p> Ho completato con successo il corso <code>CCNA Routing and Switching: Routing and Switching Essentials</code>, che mi ha permesso di affinare le competenze nella configurazione avanzata dei dispositivi di rete, l'implementazione delle <code>VLANs</code>, la gestione del <code>DHCP</code> e la configurazione del <code>NAT</code>. Questo corso mi ha fornito una solida base pratica per gestire reti complesse e migliorare le prestazioni di connettività. </p> <hr> <strong><h4>CCNA 3: Scaling Networks</h4></strong> <p> Ho completato con successo il corso <code>CCNA Routing and Switching: Scaling Networks</code>, dove ho approfondito la configurazione e la risoluzione dei problemi relativi agli <code>STP</code> (Spanning Tree Protocol) e al VLAN Trunking Protocol (<code>VTP</code>). Ho acquisito competenze avanzate nella gestione delle <code>VLAN</code>, la configurazione degli <code>inter-VLAN</code>, e la gestione dei protocolli <code>IPv4</code> e <code>IPv6</code>. Questo corso mi ha preparato ad affrontare con successo reti di dimensioni maggiori e a implementare soluzioni scalabili. </p> <hr> <strong><h4>CCNA 4: Advanced Networks</h4></strong> <p> Ho completato con successo il corso <code>CCNA Routing and Switching: Advanced Networks</code>, che mi ha fornito conoscenze approfondite sulle reti <code>WAN</code> e su come configurare e risolvere problemi di <code>PPP</code> (Point-to-Point Protocol). Durante il corso, ho imparato a implementare <code>PPPoE</code>, <code>GRE</code> e single-homed <code>eBGP</code>, oltre a sviluppare competenze nella sicurezza <code>LAN</code> e nella risoluzione dei problemi di rete per piccole e medie imprese. </p>"
      },
      {
        "identifier": 3,
        "title": "Corso Lingua Inglese: Livello B1",
        "from": "Da Gennaio 2017",
        "to": "A Maggio 2017",
        "role": "Corso di Inglese Livello B1",
        "where": "City of Bristol College, Bristol, United Kingdom",
        "description": "<p> Ho completato con successo il corso di Lingua Inglese al livello B1, acquisendo competenze avanzate nella lingua inglese sia scritta che parlata. Durante il corso, ho affinato la capacità di partecipare a conversazioni quotidiane, esprimere opinioni e comprendere testi complessi. Ho sviluppato competenze linguistiche fondamentali come la grammatica, l'espansione del vocabolario e strategie efficaci di comunicazione. <br><br> Il corso ha migliorato le mie competenze di ascolto, consentendomi di comprendere l'inglese parlato a velocità normale con vari accenti e dialetti. Ho anche migliorato la comprensione della lettura, estraendo efficacemente informazioni chiave da articoli, rapporti e testi letterari. <br><br> Inoltre, ho praticato la scrittura di testi coerenti e strutturati, tra cui email formali, rapporti e saggi. Questo corso mi ha fornito una solida base nella competenza della lingua inglese, permettendomi di comunicare in modo fluente e sicuro in contesti professionali e sociali. </p>"
      },
      {
        "identifier": 4,
        "title": "CEH Cyber Security",
        "from": "Da Novembre 2017",
        "to": "A Febbraio 2018",
        "role": "Cyber Security: Introducing to the World of Cyber Security",
        "where": "Smart Learning, Udemy",
        "description": "<p> Durante il corso di Cyber Security CEH, ho approfondito il ruolo dell'Ethical Hacker e le sue responsabilità nella protezione delle reti informatiche. Ho acquisito competenze avanzate nella diagnosi e risoluzione di vulnerabilità, preservando l'integrità dei dati durante il processo. <br><br> Ho imparato a configurare e utilizzare macchine virtuali per la simulazione di ambienti di test sicuri, installando e gestendo sistemi operativi come <code>Windows</code> e <code>Kali Linux</code>. Ho sviluppato competenze nell'uso avanzato dei comandi di sistema in ambiente <code>Linux</code> e nella gestione dei principali protocolli di rete come <code>DNS</code>, <code>PING</code>, <code>ARP</code>, e <code>TRACEROUTE</code>. <br><br> Durante il corso, ho esplorato tecniche di hacking etico come il <code>Google Hacking</code> per la raccolta di informazioni sensibili online e l'identificazione di vulnerabilità con strumenti come <code>Shodan</code> e <code>Nmap</code>. Ho appreso a configurare e utilizzare honeypot per attirare e analizzare attacchi, e ho acquisito competenze avanzate nell'analisi del traffico di rete con strumenti come <code>Wireshark</code>. <br><br> Inoltre, ho studiato le differenze tra protocolli di comunicazione <code>TCP</code> e <code>UDP</code>, le tecniche di fingerprinting attivo e passivo per l'identificazione di sistemi e applicazioni, e ho eseguito vulnerabilità assessment con strumenti come <code>Nessus</code> e <code>Nexpose</code>. <br><br> Ho anche approfondito l'utilizzo di framework come <code>Metasploit</code> per lo sviluppo e l'esecuzione di exploit, e ho acquisito competenze nella shell <code>METERPRETER</code> per il controllo remoto dei sistemi compromessi. Ho studiato tecniche di escalation dei privilegi e l'iniezione di codice malevolo per testare la sicurezza degli applicativi. <br><br> Infine, ho redatto report dettagliati sui risultati dei Penetration Testing, documentando in modo completo tutte le vulnerabilità scoperte e fornendo raccomandazioni di sicurezza per migliorare la protezione delle reti e dei sistemi. </p>"
      }
    ]
  },
  "contact": {
    "title": "Contattami",
    "profile_title": "Profilo",
    "name": "Giovanni Lamarmora",
    "name_title": "Nome",
    "age_title": "Età",
    "from": "Milano, Italia",
    "from_title": "Da",
    "downloadCV": "Download CV",
    "follow_me": "Seguimi",
    "contact_me": "Inviami un messaggio",
    "email_title": "Email",
    "description": "Dimmi di più riguardo la tua Richiesta...",
    "send": "Invia Messaggio",
    "experience_title": "Anni di esperienza",
    "work_project": "10",
    "work_project_title": "Progetti eseguiti <br>Be | Shaping The Future",
    "project": "11",
    "project_title": "Progetti Personali",
    "course": "8",
    "course_title": "Corsi eseguiti",
    "send_email": {
      "title": "Ciao $NAME$ , vuoi inviare il messaggio?",
      "not_send": "Non Inviare",
      "send": "Invia",
      "send_error": "Errore durante l'invio del messaggio!",
      "send_success": "Messaggio inviato correttamente!",
      "not_send_error": "Non inviato!"
    }
  },
  "project-section": {
    "title": "Progetti Personali",
    "btn_project": "Esplora Tutti",
    "go_back": "Torna alla Homepage",
    "projects": [
      {
        "id": 1,
        "image": "assets/img/project/send-email.webp",
        "title": "Email-Sender",
        "subtitle": "Service",
        "description": "Applicazione basata su Spring Boot che utilizza il servizio SMTP di Google per l'invio di email. Integrata sul tuo sito web e in altre applicazioni personali per gestire comunicazioni dirette e notifiche.",
        "button_text": "Apri App",
        "button_link": "https://email-sender.giovannilamarmora.com"
      },
      {
        "id": 2,
        "image": "assets/img/project/logo_no_name.png",
        "button_link": "https://moneystats.github.io",
        "title": "MoneyStats",
        "subtitle": "Application",
        "button_text": "Apri App",
        "description": "Applicazione sviluppata in Spring Boot e Angular per la gestione del patrimonio e delle finanze personali. Utilizza MySQL per il backend, offrendo agli utenti la possibilità di monitorare e analizzare le proprie entrate e uscite."
      },
      {
        "id": 3,
        "image": "assets/img/project/GitHub-Alternatives.webp",
        "title": "Tutti i progetti su Github",
        "subtitle": "Giovanni Lamarmora",
        "button_text": "Esplora Tutti",
        "button_link": "https://github.com/giovannilamarmora",
        "description": "Scopri una varietà di progetti su GitHub che riflettono il mio impegno e le mie competenze nello sviluppo software. Dai progetti personali agli esempi di codice e contributi open-source, ogni repository rappresenta un'opportunità di esplorare le mie capacità in diversi ambiti tecnologici."
      }
    ]
  },
  "cookie-policy": {
    "title": "Cookie Policy",
    "go_back": "Torna alla Homepage",
    "payload": "<div class='policy mx-auto'><style> .policy { max-width: 1500px; } .h3 { letter-spacing: 5px !important; text-transform: uppercase; font: 20px 'Lato', sans-serif !important; color: azure; text-align: center; } p, a, li, h5, h4, h3, h2, h1 { color: aliceblue !important; } .accordion-button, .accordion-item, .accordion-header, .accordion-body { border-radius: 20px !important; background-color: #111 !important; } .accordion-button:focus { z-index: 3; border-color: transparent !important; outline: 0 !important; box-shadow: 0 0 0 0.25rem rgba(105, 105, 105, 0); } .accordion-button.collapsed { z-index: 0; } .accordion-button:not(.collapsed) { z-index: 0; } .accordion-body { background-color: #111 !important; color: 'aliceblue'; } .title { background-color: #111 !important; color: aliceblue !important; } a { text-decoration: none; } </style> <p> Questo documento contiene informazioni in merito alle tecnologie che consentono a questa Applicazione di raggiungere gli scopi descritti di seguito. Tali tecnologie permettono al Titolare di raccogliere e salvare informazioni (per esempio tramite l’utilizzo di Cookie) o di utilizzare risorse (per esempio eseguendo uno script) sul dispositivo dell’Utente quando quest’ultimo interagisce con questa Applicazione. </p> <p> Per semplicità, in questo documento tali tecnologie sono sinteticamente definite “Strumenti di Tracciamento”, salvo vi sia ragione di differenziare.<br /> Per esempio, sebbene i Cookie possano essere usati in browser sia web sia mobili, sarebbe fuori luogo parlare di Cookie nel contesto di applicazioni per dispositivi mobili, dal momento che si tratta di Strumenti di Tracciamento che richiedono la presenza di un browser. Per questo motivo, all’interno di questo documento il termine Cookie è utilizzato solo per indicare in modo specifico quel particolare tipo di Strumento di Tracciamento. </p> <p> Alcune delle finalità per le quali vengono impiegati Strumenti di Tracciamento potrebbero, inoltre richiedere il consenso dell’Utente. Se viene prestato il consenso, esso può essere revocato liberamente in qualsiasi momento seguendo le istruzioni contenute in questo documento. </p> <p> Questa Applicazione utilizza Strumenti di Tracciamento gestiti direttamente dal Titolare (comunemente detti Strumenti di Tracciamento “di prima parte”) e Strumenti di Tracciamento che abilitano servizi forniti da terzi (comunemente detti Strumenti di Tracciamento “di terza parte”). Se non diversamente specificato all’interno di questo documento, tali terzi hanno accesso ai rispettivi Strumenti di Tracciamento.<br /> Durata e scadenza dei Cookie e degli altri Strumenti di Tracciamento simili possono variare a seconda di quanto impostato dal Titolare o da ciascun fornitore terzo. Alcuni di essi scadono al termine della sessione di navigazione dell’Utente.<br /> In aggiunta a quanto specificato nella descrizione di ciascuna delle categorie di seguito riportate, gli Utenti possono ottenere informazioni più dettagliate ed aggiornate sulla durata, così come qualsiasi altra informazione rilevante - quale la presenza di altri Strumenti di Tracciamento - nelle privacy policy dei rispettivi fornitori terzi (tramite i link messi a disposizione) o contattando il Titolare. </p> <br /> <hr /> <br /> <h3 style='text-align: left' class='fw-bold'> Come questa Applicazione utilizza gli Strumenti di Tracciamento </h3> <br /> <h4 class='fw-bold'>Necessari</h4> <p> Questa Applicazione utilizza Cookie comunemente detti “tecnici” o altri Strumenti di Tracciamento analoghi per svolgere attività strettamente necessarie a garantire il funzionamento o la fornitura del Servizio. </p> <h5>Strumenti di Tracciamento tecnici</h5> <p>Durata di archiviazione:</p> <ul> <li>_ga: 2 anni</li> <li>Trace-ID: durata della sessione</li> <li>Span-ID: durata della sessione</li> <li>Parent-ID: durata della sessione</li> <li>profile_language: non definita</li> <li>last_update_en-GB: non definita</li> <li>portfolio_data_en-GB: non definita</li> </ul> <br /> <h5>Strumenti di Tracciamento gestiti da terze parti</h5> <div class='row mt-3 mb-3'> <div class='col-12 col-md-6'> <div class='mx-auto accordion accordion-flush' id='cloudflare'> <div class='accordion-item accordion_color'> <h2 class='accordion-header'> <button class='accordion-button collapsed title' type='button' data-bs-toggle='collapse' data-bs-target='#cloudflare-collapseOne' aria-expanded='false' aria-controls='cloudflare-collapseOne' > Cloudflare (Cloudflare Inc.) </button> </h2> <div id='cloudflare-collapseOne' class='accordion-collapse collapse' data-bs-parent='#cloudflare' > <div class='accordion-body'> <div class='wrap'> <p> Cloudflare è un servizio di ottimizzazione e distribuzione del traffico fornito da Cloudflare Inc. Le modalità di integrazione di Cloudflare prevedono che questo filtri tutto il traffico di questa Applicazione, ossia le comunicazioni fra questa Applicazione ed il browser dell’Utente, permettendo anche la raccolta di dati statistici su di esso. </p> </div> <p> Dati Personali trattati: Strumenti di Tracciamento e varie tipologie di Dati secondo quanto specificato dalla privacy policy del servizio. </p> <p> Luogo del trattamento: Stati Uniti &ndash; <a href='https://www.cloudflare.com/privacypolicy/' target='_blank' rel='noopener noreferrer' >Privacy Policy</a >. </p> </div> </div> </div> </div> </div> <div class='col-12 col-md-6'> <div class='mx-auto accordion accordion-flush' id='google_tag'> <div class='accordion-item accordion_color'> <h2 class='accordion-header'> <button class='accordion-button collapsed title' type='button' data-bs-toggle='collapse' data-bs-target='#google_tag-collapseOne' aria-expanded='false' aria-controls='google_tag-collapseOne' > Google Tag Manager (Google LLC) </button> </h2> <div id='google_tag-collapseOne' class='accordion-collapse collapse' data-bs-parent='#google_tag' > <div class='accordion-body'> <div class='wrap'> <p> Google Tag Manager è un servizio di gestione dei tag fornito da Google LLC. </p> <p> Per conoscere l'utilizzo dei Dati da parte di Google, consulta la loro <a href='https://policies.google.com/technologies/partner-sites' >partner policy</a > e la loro <a href='https://business.safety.google/privacy/' >pagina dei Dati Commerciali</a >. </p> </div> <p> Dati Personali trattati: Dati di utilizzo e Strumenti di Tracciamento. </p> <p> Luogo del trattamento: Stati Uniti &ndash; <a href='https://business.safety.google/privacy/' target='_blank' rel='noopener noreferrer' >Privacy Policy</a >. </p> </div> </div> </div> </div> </div> </div> <br /> <br /> <h4 class='fw-bold'>Esperienza</h4> <p> Questa Applicazione utilizza Strumenti di Tracciamento per migliorare la qualità della user experience e consentire le interazioni con contenuti, network e piattaforme esterni. </p> <br /> <h5>Strumenti di Tracciamento gestiti da terze parti</h5> <div class='row mt-3 mb-3'> <div class='col-12 col-md-12'> <div class='mx-auto accordion accordion-flush' id='font_awe'> <div class='accordion-item accordion_color'> <h2 class='accordion-header'> <button class='accordion-button collapsed title' type='button' data-bs-toggle='collapse' data-bs-target='#font_awe-collapseOne' aria-expanded='false' aria-controls='font_awe-collapseOne' > Font Awesome () </button> </h2> <div id='font_awe-collapseOne' class='accordion-collapse collapse' data-bs-parent='#font_awe' > <div class='accordion-body'> <div class='wrap'> <p> Font Awesome è un servizio di visualizzazione di stili di carattere gestito da che permette a questa Applicazione di integrare tali contenuti all’interno delle proprie pagine. </p> </div> <p> Dati Personali trattati: Dati di utilizzo e Strumenti di Tracciamento. </p> <!-- Service end --> </div> </div> </div> </div> </div> </div> <br /> <br /> <h4 class='fw-bold'>Misurazione</h4> <p> Questa Applicazione utilizza Strumenti di Tracciamento per misurare il traffico e analizzare il comportamento degli Utenti per migliorare il Servizio. </p> <h5>Strumenti di Tracciamento gestiti da terze parti</h5> <div class='row mt-3 mb-3'> <div class='col-12 col-md-12'> <div class='mx-auto accordion accordion-flush' id='analytics'> <div class='accordion-item accordion_color'> <h2 class='accordion-header'> <button class='accordion-button collapsed title' type='button' data-bs-toggle='collapse' data-bs-target='#analytics-collapseOne' aria-expanded='false' aria-controls='analytics-collapseOne' > Google Analytics 4 (Google LLC) </button> </h2> <div id='analytics-collapseOne' class='accordion-collapse collapse' data-bs-parent='#analytics' > <div class='accordion-body'> <div class='wrap'> <p> Google Analytics è un servizio di statistica fornito da Google LLC (“Google”). Google utilizza i Dati Personali raccolti allo scopo di tracciare ed esaminare l’utilizzo di questa Applicazione, compilare report e condividerli con gli altri servizi sviluppati da Google. Google potrebbe utilizzare i Dati Personali per contestualizzare e personalizzare gli annunci del proprio network pubblicitario. In Google Analytics 4, gli indirizzi IP vengono utilizzati al momento della raccolta e poi eliminati prima che i dati vengano registrati in qualsiasi data center o server. Per saperne di più, è possibile consultare la <a href='https://support.google.com/analytics/answer/12017362?hl=it&amp;ref_topic=2919631' >documentazione ufficiale di Google</a >. </p> <p> Per conoscere l'utilizzo dei Dati da parte di Google, consulta la loro <a href='https://policies.google.com/technologies/partner-sites' >partner policy</a > e la loro <a href='https://business.safety.google/privacy/' >pagina dei Dati Commerciali</a >. </p> </div> <p> Dati Personali trattati: Dati di utilizzo, numero di Utenti, statistiche delle sessioni e Strumenti di Tracciamento. </p> <p> Luogo del trattamento: Stati Uniti &ndash; <a href='https://business.safety.google/privacy/' target='_blank' rel='noopener noreferrer' >Privacy Policy</a > &ndash; <a href='https://tools.google.com/dlpage/gaoptout?hl=it' >Opt Out</a >. </p> <p>Durata di archiviazione:</p> <ul> <li>_ga: 2 anni</li> <li>_ga_*: 2 anni</li> </ul> <!-- Service end --> </div> </div> </div> </div> </div> </div> <br /> <br /> <h4 class='fw-bold'> Come gestire le preferenze e prestare o revocare il consenso su questa Applicazione </h4> <p> Qualora l’utilizzo dei Tracker sia basato sul consenso, l’Utente può fornire o revocare tale consenso impostando o aggiornando le proprie preferenze tramite il relativo pannello delle scelte in materia di privacy disponibile su questa Applicazione. </p> <p> Per quanto riguarda Strumenti di Tracciamento di terza parte, gli Utenti possono gestire le proprie preferenze visitando il relativo link di opt out (qualora disponibile), utilizzando gli strumenti descritti nella privacy policy della terza parte o contattando quest'ultima direttamente. </p> <br /> <h5 class='fw-bold'> Come controllare o eliminare Cookie e tecnologie simili tramite le impostazioni del tuo dispositivo </h5> <p> Gli Utenti possono utilizzare le impostazioni del proprio browser per: </p> <ul> <li> Vedere quali Cookie o altre tecnologie simili sono stati impostati sul dispositivo; </li> <li>Bloccare Cookie o tecnologie simili;</li> <li>Cancellare i Cookie o tecnologie simili dal browser.</li> </ul> <p> Le impostazioni del browser, tuttavia, non consentono un controllo granulare del consenso per categoria. </p> <p> Gli Utenti possono, per esempio, trovare informazioni su come gestire i Cookie in alcuni dei browser più diffusi ai seguenti indirizzi: </p> <ul> <li> <a rel='noopener nofollow' target='_blank' href='https://support.google.com/chrome/answer/95647?hl=it&p=cpn_cookies' >Google Chrome</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='https://support.mozilla.org/it/kb/Attivare%20e%20disattivare%20i%20cookie' >Mozilla Firefox</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='https://support.apple.com/it-it/guide/safari/manage-cookies-and-website-data-sfri11471/' >Apple Safari</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='http://windows.microsoft.com/it-it/windows-vista/block-or-allow-cookies' >Microsoft Internet Explorer</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='https://support.microsoft.com/it-it/help/4027947' >Microsoft Edge</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='https://support.brave.com/hc/articles/360022806212-How-do-I-use-Shields-while-browsing' >Brave</a > </li> <li> <a rel='noopener nofollow' target='_blank' href='https://help.opera.com/latest/web-preferences/#cookies' >Opera</a > </li> </ul> <p> Gli Utenti possono inoltre gestire alcuni Strumenti di Tracciamento per applicazioni mobili disattivandoli tramite le apposite impostazioni del dispositivo, quali le impostazioni di pubblicità per dispositivi mobili o le impostazioni relative al tracciamento in generale (gli Utenti possono consultare le impostazioni del dispositivo per individuare quella pertinente). </p> <br /> <h5 class='fw-bold'> Conseguenze legate al rifiuto dell'utilizzo di Strumenti di Tracciamento </h5> <p> Gli Utenti sono liberi di decidere se permettere o meno l'utilizzo di Strumenti di Tracciamento. Tuttavia, si noti che gli Strumenti di Tracciamento consentono a questa Applicazione di fornire agli Utenti un'esperienza migliore e funzionalità avanzate (in linea con le finalità delineate nel presente documento). Pertanto, qualora l'Utente decida di bloccare l'utilizzo di Strumenti di Tracciamento, il Titolare potrebbe non essere in grado di fornire le relative funzionalità. </p> <br /> <br /> <h4 class='fw-bold'>Titolare del Trattamento dei Dati</h4> <!-- Owner start --> <p>Giovanni Lamarmora</p> <p> <strong>Indirizzo email del Titolare:</strong> giovannilamarmora.working&#64;.com </p> <!-- Owner end --> <p> Dal momento che l’uso di Strumenti di Tracciamento di terza parte su questa Applicazione non può essere completamente controllato dal Titolare, ogni riferimento specifico a Strumenti di Tracciamento di terza parte è da considerarsi indicativo. Per ottenere informazioni complete, gli Utenti sono gentilmente invitati a consultare la privacy policy dei rispettivi servizi terzi elencati in questo documento. </p> <p> Data l'oggettiva complessità di identificazione delle tecnologie di tracciamento, gli Utenti sono invitati a contattare il Titolare qualora volessero ricevere ulteriori informazioni in merito all'utilizzo di tali tecnologie su questa Applicazione. </p> <div class='row mt-3 mb-3'> <div class='col-12 col-md-12'> <div class='mx-auto accordion accordion-flush' id='owner'> <div class='accordion-item accordion_color'> <h2 class='accordion-header'> <button class='accordion-button collapsed title' type='button' data-bs-toggle='collapse' data-bs-target='#owner-collapseOne' aria-expanded='false' aria-controls='owner-collapseOne' > Definizioni e riferimenti legali </button> </h2> <div id='owner-collapseOne' class='accordion-collapse collapse' data-bs-parent='#owner' > <div class='accordion-body'> <div class='wrap'> <h5 class='fw-bold'>Dati Personali (o Dati)</h5> <p> Costituisce dato personale qualunque informazione che, direttamente o indirettamente, anche in collegamento con qualsiasi altra informazione, ivi compreso un numero di identificazione personale, renda identificata o identificabile una persona fisica. </p> <br /> <h5 class='fw-bold'>Dati di Utilizzo</h5> <p> Sono le informazioni raccolte automaticamente attraverso questa Applicazione (anche da applicazioni di parti terze integrate in questa Applicazione), tra cui: gli indirizzi IP o i nomi a dominio dei computer utilizzati dall’Utente che si connette con questa Applicazione, gli indirizzi in notazione URI (Uniform Resource Identifier), l’orario della richiesta, il metodo utilizzato nell’inoltrare la richiesta al server, la dimensione del file ottenuto in risposta, il codice numerico indicante lo stato della risposta dal server (buon fine, errore, ecc.) il paese di provenienza, le caratteristiche del browser e del sistema operativo utilizzati dal visitatore, le varie connotazioni temporali della visita (ad esempio il tempo di permanenza su ciascuna pagina) e i dettagli relativi all&rsquo;itinerario seguito all&rsquo;interno dell&rsquo;Applicazione, con particolare riferimento alla sequenza delle pagine consultate, ai parametri relativi al sistema operativo e all&rsquo;ambiente informatico dell&rsquo;Utente. </p> <br /> <h5 class='fw-bold'>Utente</h5> <p> L'individuo che utilizza questa Applicazione che, salvo ove diversamente specificato, coincide con l'Interessato. </p> <br /> <h5 class='fw-bold'>Interessato</h5> <p>La persona fisica cui si riferiscono i Dati Personali.</p> <br /> <h5 class='fw-bold'> Responsabile del Trattamento (o Responsabile) </h5> <p> La persona fisica, giuridica, la pubblica amministrazione e qualsiasi altro ente che tratta dati personali per conto del Titolare, secondo quanto esposto nella presente privacy policy. </p> <br /> <h5 class='fw-bold'>Titolare del Trattamento (o Titolare)</h5> <p> La persona fisica o giuridica, l'autorità pubblica, il servizio o altro organismo che, singolarmente o insieme ad altri, determina le finalità e i mezzi del trattamento di dati personali e gli strumenti adottati, ivi comprese le misure di sicurezza relative al funzionamento ed alla fruizione di questa Applicazione. Il Titolare del Trattamento, salvo quanto diversamente specificato, è il titolare di questa Applicazione. </p> <br /> <h5 class='fw-bold'>Questa Applicazione</h5> <p> Lo strumento hardware o software mediante il quale sono raccolti e trattati i Dati Personali degli Utenti. </p> <br /> <h5 class='fw-bold'>Servizio</h5> <p> Il Servizio fornito da questa Applicazione così come definito nei relativi termini (se presenti) su questo sito/applicazione. </p> <br /> <h5 class='fw-bold'>Unione Europea (o UE)</h5> <p> Salvo ove diversamente specificato, ogni riferimento all’Unione Europea contenuto in questo documento si intende esteso a tutti gli attuali stati membri dell’Unione Europea e dello Spazio Economico Europeo. </p> <br /> <h5 class='fw-bold'>Cookie</h5> <p> I Cookie sono Strumenti di Tracciamento che consistono in piccole porzioni di dati conservate all'interno del browser dell'Utente. </p> <br /> <h5 class='fw-bold'>Strumento di Tracciamento</h5> <p> Per Strumento di Tracciamento s’intende qualsiasi tecnologia - es. Cookie, identificativi univoci, web beacons, script integrati, e-tag e fingerprinting - che consenta di tracciare gli Utenti, per esempio raccogliendo o salvando informazioni sul dispositivo dell’Utente. </p> <hr /> <h5 class='fw-bold'>Riferimenti legali</h5> <p> Ove non diversamente specificato, questa informativa privacy riguarda esclusivamente questa Applicazione. </p> </div> </div> </div> </div> </div> </div> </div> <div class='text-center'> <p>Ultima modifica: 23 ottobre 2024</p> <!-- /footer --> </div> </div>"
  },
  "info": {
    "title": "Questo Sito e in costruzione",
    "text": "La versione visualizzata non è la versione ufficiale, nuovi contenuti arriveranno presto."
  },
  "email_content": {
    "title": "BENVENUTO $NAME$!",
    "sub-title": "Grazie per avermi contattato, questa è una copia della tua email.",
    "important": "Ti contatterò il prima possibile, nel frattempo se hai altre domande, rispondi pure a questa email.",
    "thanks": "Grazie, Giovanni Lamarmora"
  }
}
